music_app/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "coOdPxSfcmNBDzndz-_PBw"], ["updated_at", "2020-04-28 21:12:49.398192"], ["id", 1]]